---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LooseLabeledDimensionRegenFailure
source: html/88b8fb84-023d-8d0c-83da-13af6bee640b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LooseLabeledDimensionRegenFailure Property

Failed to Regenerate Family

## Syntax (C#)
```csharp
public static FailureDefinitionId LooseLabeledDimensionRegenFailure { get; }
```